FreedomVeiculosEletricos/zephyr-motion-control/drivers/motor_actuator/motor_actuator_stm32.c
/*
 * Copyright (c) 2026 Zephyr Motor Control Contributors
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * STM32 motor power stage: ST LL timer only (no project HAL file). Advanced
 * timers (TIM1/TIM8) use complementary CHx/CHxN; general-purpose timers with
 * single-ended route one HS PWM pin per leg (gate driver generates LS).
 * actuator callback runs from the timer update interrupt
 * (interrupt-names "up" or "global" on the st,pwm-timer node).
 */

#define DT_DRV_COMPAT zephyr_motor_stage_hbridge_stm32

#include <errno.h>
#include <stdint.h>

#include <stm32_ll_tim.h>

#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/counter.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/motor/motor_actuator.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/irq.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/atomic.h>
#include <zephyr/sys/util.h>

#include "motor_actuator_common.h"

LOG_MODULE_REGISTER(motor_actuator_stm32, CONFIG_MOTOR_DRIVER_LOG_LEVEL);

#define HB_MAX 3U

/* Custom pinctrl state IDs picked up by Z_PINCTRL_STATE_ID via "complementary"
 * and "single-ended" entries in pinctrl-names.
 */
#define PINCTRL_STATE_COMPLEMENTARY PINCTRL_STATE_PRIV_START
#define PINCTRL_STATE_SINGLE_ENDED  (PINCTRL_STATE_PRIV_START + 1U)

struct motor_actuator_stm32_config {
	TIM_TypeDef *tim;
	const struct stm32_pclken *pclken;
	size_t pclk_len;
	const uint8_t *pwm_ch;
	uint8_t n_half_bridges;
	bool single_ended;
	uint32_t pwm_freq_hz;
	uint32_t trgo;
	uint32_t deadtime_ns;
	struct gpio_dt_spec nfault;
	struct gpio_dt_spec nsleep;
	struct gpio_dt_spec en;
	bool has_nfault;
	bool has_nsleep;
	bool has_en;
	const struct device *slow_timer;
	uint32_t slow_sample_div;
	struct motor_stage_config stage_cfg;
};

struct motor_actuator_stm32_data {
	const struct device *self;
	motor_actuator_callback_t actuator_cb;
	void *actuator_user_data;
	motor_actuator_callback_t slow_cb;
	void *slow_user_data;
	motor_fault_cb_t fault_cb;
	void *fault_user_data;
	struct gpio_callback nfault_cb;
	atomic_t slow_timer_running;
	uint32_t slow_timer_ticks;
	/* Cached at init: ARR + 1 = full-scale duty for oc_set_compare(). */
	uint32_t max_duty;
	uint32_t fault_flags;
	enum motor_drive_mode drive_mode;
	bool running;
};

static void nfault_gpio_cb(const struct device *dev, struct gpio_callback *cb, uint32_t pins)
{
	struct motor_actuator_stm32_data *data = CONTAINER_OF(cb, struct motor_actuator_stm32_data, nfault_cb);

	ARG_UNUSED(dev);
	ARG_UNUSED(pins);

	data->fault_flags |= MOTOR_FAULT_GATE_DRIVER;
	if (data->fault_cb != NULL) {
		data->fault_cb(data->self, MOTOR_FAULT_GATE_DRIVER, data->fault_user_data);
	}
}

#define MOTOR_ACTUATOR_STM32_TRGO_FROM_ENUM(inst)                                                         \
	((DT_ENUM_IDX(DT_DRV_INST(inst), trgo_source) == 0)                                           \
		 ? LL_TIM_TRGO_UPDATE                                                               \
		 : (DT_ENUM_IDX(DT_DRV_INST(inst), trgo_source) == 1)                                  \
				 ? LL_TIM_TRGO_RESET                                                \
				 : (DT_ENUM_IDX(DT_DRV_INST(inst), trgo_source) == 2)                    \
						 ? LL_TIM_TRGO_ENABLE                               \
						 : LL_TIM_TRGO_CC1IF)

static bool tim_is_advanced(const TIM_TypeDef *tim)
{
	return (tim == TIM1) || (tim == TIM8) || (tim == TIM15) || (tim == TIM16) ||
	       (tim == TIM17);
}

/* The timer is programmed straight through LL, so nothing else in the system
 * gates its clock: enabling it is part of this driver's init.
 */
static int motor_actuator_stm32_enable_tim_clock(const struct motor_actuator_stm32_config *cfg,
						 uint32_t *rate_hz)
{
	const struct device *clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	int err;

	if (!device_is_ready(clk)) {
		LOG_ERR("clock controller not ready");
		return -ENODEV;
	}

	err = clock_control_on(clk, (clock_control_subsys_t)&cfg->pclken[0]);
	if (err != 0) {
		LOG_ERR("could not enable the timer bus clock (%d)", err);
		return err;
	}

	if (cfg->pclk_len > 1U) {
		err = clock_control_configure(clk, (clock_control_subsys_t)&cfg->pclken[1], NULL);
		if (err != 0) {
			LOG_ERR("could not select the timer clock source (%d)", err);
			return err;
		}
	}

	err = clock_control_get_rate(clk, (clock_control_subsys_t)&cfg->pclken[cfg->pclk_len - 1U],
				     rate_hz);
	if (err != 0) {
		LOG_ERR("could not read the timer clock rate (%d)", err);
		return err;
	}

	return 0;
}

/** Encode dead-time for BDTR DTG[7:0] — t_dt = DTG * t_dts, t_dts = 1 / tim_clk. */
static uint8_t encode_deadtime(uint32_t tim_clk_hz, uint32_t deadtime_ns)
{
	uint64_t ticks = ((uint64_t)deadtime_ns * (uint64_t)tim_clk_hz) / 1000000000ULL;

	if (ticks > 255ULL) {
		return 255U;
	}
	return (uint8_t)ticks;
}

static uint32_t tim_ch_mask(uint8_t ch)
{
	switch (ch) {
	case 1U:
		return LL_TIM_CHANNEL_CH1;
	case 2U:
		return LL_TIM_CHANNEL_CH2;
	case 3U:
		return LL_TIM_CHANNEL_CH3;
	case 4U:
		return LL_TIM_CHANNEL_CH4;
	default:
		return 0U;
	}
}

static uint32_t tim_ch_pair_mask(uint8_t ch)
{
	switch (ch) {
	case 1U:
		return LL_TIM_CHANNEL_CH1 | LL_TIM_CHANNEL_CH1N;
	case 2U:
		return LL_TIM_CHANNEL_CH2 | LL_TIM_CHANNEL_CH2N;
	case 3U:
		return LL_TIM_CHANNEL_CH3 | LL_TIM_CHANNEL_CH3N;
	case 4U:
		return LL_TIM_CHANNEL_CH4;
	default:
		return 0U;
	}
}

static void oc_set_compare(TIM_TypeDef *tim, uint8_t ch, uint32_t pulse)
{
	switch (ch) {
	case 1U:
		LL_TIM_OC_SetCompareCH1(tim, pulse);
		break;
	case 2U:
		LL_TIM_OC_SetCompareCH2(tim, pulse);
		break;
	case 3U:
		LL_TIM_OC_SetCompareCH3(tim, pulse);
		break;
	case 4U:
		LL_TIM_OC_SetCompareCH4(tim, pulse);
		break;
	default:
		break;
	}
}

static void oc_set_single_ended_pwm(TIM_TypeDef *tim, uint8_t ch, uint32_t pulse)
{
	LL_TIM_OC_SetMode(tim, tim_ch_mask(ch), LL_TIM_OCMODE_PWM1);
	oc_set_compare(tim, ch, pulse);
	LL_TIM_CC_EnableChannel(tim, tim_ch_mask(ch));
}

static void oc_set_complementary_pwm(TIM_TypeDef *tim, uint8_t ch, uint32_t pulse)
{
	uint32_t pair = tim_ch_pair_mask(ch);

	LL_TIM_OC_SetMode(tim, tim_ch_mask(ch), LL_TIM_OCMODE_PWM1);
	oc_set_compare(tim, ch, pulse);
	LL_TIM_CC_EnableChannel(tim, pair);
}

