FreedomVeiculosEletricos/zephyr-motion-control/drivers/motor_actuator/motor_actuator_stm32.c
static int tim_base_init(TIM_TypeDef *tim, uint32_t tim_clk, uint32_t freq_hz, uint32_t *arr_out)
{
	uint32_t psc = 0U;
	uint32_t arr;

	if ((tim == NULL) || (freq_hz == 0U) || (tim_clk == 0U)) {
		return -EINVAL;
	}

	arr = tim_clk / freq_hz;
	if (arr == 0U) {
		LOG_ERR("PWM frequency %u Hz is above the %u Hz timer clock", freq_hz, tim_clk);
		return -EINVAL;
	}
	arr -= 1U;

	while (arr > 0xFFFFUL) {
		psc++;
		arr = (tim_clk / (freq_hz * (psc + 1U))) - 1U;
		if (psc > 0xFFFFUL) {
			return -EINVAL;
		}
	}

	LL_TIM_SetPrescaler(tim, psc);
	LL_TIM_SetAutoReload(tim, arr);
	LL_TIM_SetCounterMode(tim, LL_TIM_COUNTERMODE_UP);
	LL_TIM_SetClockDivision(tim, LL_TIM_CLOCKDIVISION_DIV1);
	LL_TIM_EnableARRPreload(tim);

	if (arr_out != NULL) {
		*arr_out = arr;
	}

	return 0;
}

static int tim_gp_pwm_init(TIM_TypeDef *tim, uint32_t tim_clk, uint32_t freq_hz, const uint8_t *ch,
			   uint8_t n_ch, uint32_t trgo, uint32_t *max_duty_out)
{
	int err;
	uint32_t arr;
	uint8_t i;

	err = tim_base_init(tim, tim_clk, freq_hz, &arr);
	if (err != 0) {
		return err;
	}

	for (i = 0U; i < n_ch; i++) {
		oc_set_single_ended_pwm(tim, ch[i], 0U);
	}

	LL_TIM_SetTriggerOutput(tim, trgo);
	LL_TIM_GenerateEvent_UPDATE(tim);
	LL_TIM_EnableCounter(tim);

	if (max_duty_out != NULL) {
		*max_duty_out = arr + 1U;
	}

	return 0;
}

static int tim_hbridge_init(TIM_TypeDef *tim, uint32_t tim_clk, uint32_t freq_hz, const uint8_t *ch,
			    uint8_t n_ch, uint32_t deadtime_ns, uint32_t trgo,
			    uint32_t *max_duty_out)
{
	int err;
	uint32_t arr;
	uint8_t dtg;
	uint8_t i;

	err = tim_base_init(tim, tim_clk, freq_hz, &arr);
	if (err != 0) {
		return err;
	}

	dtg = encode_deadtime(tim_clk, deadtime_ns);
	LL_TIM_OC_SetDeadTime(tim, dtg);

	for (i = 0U; i < n_ch; i++) {
		oc_set_complementary_pwm(tim, ch[i], 0U);
	}

	LL_TIM_SetTriggerOutput(tim, trgo);
	LL_TIM_GenerateEvent_UPDATE(tim);
	LL_TIM_EnableCounter(tim);

	if (max_duty_out != NULL) {
		*max_duty_out = arr + 1U;
	}

	return 0;
}

static void tim_enable_main_output(TIM_TypeDef *tim, bool enable)
{
	if (!tim_is_advanced(tim)) {
		return;
	}

	if (enable) {
		LL_TIM_EnableAllOutputs(tim);
	} else {
		LL_TIM_DisableAllOutputs(tim);
	}
}

static int motor_actuator_stm32_set_duty(const struct device *dev, const float *duty, uint8_t n)
{
	const struct motor_actuator_stm32_config *cfg = dev->config;
	struct motor_actuator_stm32_data *data = dev->data;
	uint32_t max_duty = data->max_duty;
	uint8_t i;
	uint8_t limit;

	if (data->fault_flags != 0U) {
		return -EIO;
	}

	if (data->drive_mode == MOTOR_DRIVE_COAST) {
		for (i = 0U; i < cfg->n_half_bridges; i++) {
			oc_set_compare(cfg->tim, cfg->pwm_ch[i], 0U);
		}
		return 0;
	}

	limit = (n < cfg->n_half_bridges) ? n : cfg->n_half_bridges;
	for (i = 0U; i < limit; i++) {
		float d = duty[i];
		uint32_t cmp;

		if (d > 1.0f) {
			d = 1.0f;
		} else if (d < 0.0f) {
			d = 0.0f;
		}
		cmp = (uint32_t)(d * (float)max_duty);
		oc_set_compare(cfg->tim, cfg->pwm_ch[i], cmp);
	}

	return 0;
}

static int motor_actuator_stm32_set_drive_mode(const struct device *dev, enum motor_drive_mode mode)
{
	struct motor_actuator_stm32_data *data = dev->data;

	data->drive_mode = mode;
	if (mode == MOTOR_DRIVE_BRAKE || mode == MOTOR_DRIVE_REGEN) {
		return -ENOTSUP;
	}

	return 0;
}

static void motor_actuator_stm32_slow_alarm_cb(const struct device *counter_dev, uint8_t chan_id,
					       uint32_t ticks, void *user_data)
{
	const struct device *dev = user_data;
	struct motor_actuator_stm32_data *data = dev->data;

	ARG_UNUSED(counter_dev);
	ARG_UNUSED(chan_id);
	ARG_UNUSED(ticks);

	if (data->slow_cb != NULL) {
		data->slow_cb(dev, data->slow_user_data);
	}
	atomic_clear(&data->slow_timer_running);
}

static void motor_actuator_stm32_arm_slow_timer(const struct device *dev)
{
	const struct motor_actuator_stm32_config *cfg = dev->config;
	struct motor_actuator_stm32_data *data = dev->data;
	struct counter_alarm_cfg alarm = {
		.callback = motor_actuator_stm32_slow_alarm_cb,
		.ticks = data->slow_timer_ticks,
		.user_data = (void *)dev,
		.flags = 0U,
	};
	int err;

	if (!data->running || data->slow_timer_ticks == 0U) {
		return;
	}

	if (!atomic_cas(&data->slow_timer_running, 0, 1)) {
		return;
	}

	err = counter_set_channel_alarm(cfg->slow_timer, 0U, &alarm);
	if (err != 0) {
		atomic_clear(&data->slow_timer_running);
	}
}

static int motor_actuator_stm32_set_callback(const struct device *dev,
					     motor_actuator_callback_t fast_cb,
					     void *fast_user_data,
					     motor_actuator_callback_t slow_cb,
					     void *slow_user_data)
{
	struct motor_actuator_stm32_data *data = dev->data;

	data->actuator_cb = fast_cb;
	data->actuator_user_data = fast_user_data;
	data->slow_cb = slow_cb;
	data->slow_user_data = slow_user_data;

	return 0;
}

static int motor_actuator_stm32_set_fault_callback(const struct device *dev, motor_fault_cb_t cb,
					    void *user_data)
{
	struct motor_actuator_stm32_data *data = dev->data;

	data->fault_cb = cb;
	data->fault_user_data = user_data;

	return 0;
}

static int motor_actuator_stm32_clear_fault(const struct device *dev)
{
	struct motor_actuator_stm32_data *data = dev->data;

	data->fault_flags = 0U;
	return 0;
}

static int motor_actuator_stm32_get_fault(const struct device *dev, uint32_t *flags)
{
	struct motor_actuator_stm32_data *data = dev->data;

	if (flags == NULL) {
		return -EINVAL;
	}

	*flags = data->fault_flags;
	return 0;
}

static const struct motor_stage_config *motor_actuator_stm32_get_config(const struct device *dev)
{
	const struct motor_actuator_stm32_config *cfg = dev->config;

	return &cfg->stage_cfg;
}

static void motor_actuator_stm32_disable_outputs(const struct device *dev)
{
	const struct motor_actuator_stm32_config *cfg = dev->config;
	uint8_t i;

	for (i = 0U; i < cfg->n_half_bridges; i++) {
		oc_set_compare(cfg->tim, cfg->pwm_ch[i], 0U);
	}
}

static int motor_actuator_stm32_disable(const struct device *dev)
{
	const struct motor_actuator_stm32_config *cfg = dev->config;
	struct motor_actuator_stm32_data *data = dev->data;

	data->running = false;
	(void)counter_cancel_channel_alarm(cfg->slow_timer, 0U);
	atomic_clear(&data->slow_timer_running);
	motor_actuator_stm32_disable_outputs(dev);
	tim_enable_main_output(cfg->tim, false);
	LL_TIM_DisableCounter(cfg->tim);

	if (cfg->has_en) {
		(void)gpio_pin_set_dt(&cfg->en, 0);
	}
	if (cfg->has_nsleep) {
		(void)gpio_pin_set_dt(&cfg->nsleep, 0);
	}

	data->drive_mode = MOTOR_DRIVE_NORMAL;

