FreedomVeiculosEletricos/zephyr-motion-control/drivers/motor_actuator/motor_actuator_stm32.c
	return 0;
}

static int motor_actuator_stm32_enable(const struct device *dev)
{
	const struct motor_actuator_stm32_config *cfg = dev->config;
	struct motor_actuator_stm32_data *data = dev->data;
	int err;

	if (cfg->has_nsleep) {
		err = gpio_pin_set_dt(&cfg->nsleep, 1);
		if (err != 0) {
			return err;
		}
	}
	if (cfg->has_en) {
		err = gpio_pin_set_dt(&cfg->en, 1);
		if (err != 0) {
			return err;
		}
	}

	tim_enable_main_output(cfg->tim, true);
	LL_TIM_EnableCounter(cfg->tim);
	data->drive_mode = MOTOR_DRIVE_NORMAL;
	data->running = true;

	return 0;
}

static int motor_actuator_stm32_hw_init(const struct device *dev)
{
	const struct motor_actuator_stm32_config *cfg = dev->config;
	struct motor_actuator_stm32_data *data = dev->data;
	uint32_t tim_clk_hz;
	uint64_t slow_ticks;
	uint32_t slow_top;
	int err;

	data->self = dev;
	data->drive_mode = MOTOR_DRIVE_NORMAL;
	data->running = false;
	atomic_clear(&data->slow_timer_running);

	err = motor_actuator_stm32_enable_tim_clock(cfg, &tim_clk_hz);
	if (err != 0) {
		return err;
	}

	if (cfg->single_ended && !tim_is_advanced(cfg->tim)) {
		err = tim_gp_pwm_init(cfg->tim, tim_clk_hz, cfg->pwm_freq_hz, cfg->pwm_ch,
				      cfg->n_half_bridges, cfg->trgo, &data->max_duty);
	} else {
		err = tim_hbridge_init(cfg->tim, tim_clk_hz, cfg->pwm_freq_hz, cfg->pwm_ch,
				       cfg->n_half_bridges, cfg->deadtime_ns, cfg->trgo,
				       &data->max_duty);
	}
	if (err != 0) {
		return err;
	}

	if (!device_is_ready(cfg->slow_timer)) {
		LOG_ERR("slow timer %s is not ready", cfg->slow_timer->name);
		return -ENODEV;
	}

	slow_ticks = ((uint64_t)counter_get_frequency(cfg->slow_timer) *
		      (uint64_t)cfg->stage_cfg.pwm_period_ns * (uint64_t)cfg->slow_sample_div) /
		     (uint64_t)NSEC_PER_SEC;
	slow_top = counter_get_top_value(cfg->slow_timer);
	if ((slow_ticks == 0ULL) || (slow_ticks > (uint64_t)slow_top)) {
		LOG_ERR("outer loop period needs %llu ticks of %s, which counts up to %u; "
			"raise its st,prescaler",
			slow_ticks, cfg->slow_timer->name, slow_top);
		return -EINVAL;
	}
	data->slow_timer_ticks = (uint32_t)slow_ticks;

	err = counter_start(cfg->slow_timer);
	if ((err != 0) && (err != -EALREADY)) {
		return err;
	}

	if (cfg->has_nfault) {
		if (!gpio_is_ready_dt(&cfg->nfault)) {
			return -ENODEV;
		}

		err = gpio_pin_configure_dt(&cfg->nfault, GPIO_INPUT);
		if (err != 0) {
			return err;
		}

		gpio_init_callback(&data->nfault_cb, nfault_gpio_cb, BIT(cfg->nfault.pin));
		err = gpio_add_callback_dt(&cfg->nfault, &data->nfault_cb);
		if (err != 0) {
			return err;
		}

		err = gpio_pin_interrupt_configure_dt(&cfg->nfault, GPIO_INT_EDGE_TO_ACTIVE);
		if (err != 0) {
			return err;
		}
	}

	if (cfg->has_nsleep) {
		if (!gpio_is_ready_dt(&cfg->nsleep)) {
			return -ENODEV;
		}

		err = gpio_pin_configure_dt(&cfg->nsleep, GPIO_OUTPUT_INACTIVE);
		if (err != 0) {
			return err;
		}
	}

	if (cfg->has_en) {
		if (!gpio_is_ready_dt(&cfg->en)) {
			return -ENODEV;
		}

		err = gpio_pin_configure_dt(&cfg->en, GPIO_OUTPUT_INACTIVE);
		if (err != 0) {
			return err;
		}
	}

	motor_actuator_stm32_disable_outputs(dev);

	LL_TIM_EnableIT_UPDATE(cfg->tim);

	return 0;
}

const struct motor_actuator_ops motor_actuator_stm32_api = {
	.enable = motor_actuator_stm32_enable,
	.disable = motor_actuator_stm32_disable,
	.set_duty = motor_actuator_stm32_set_duty,
	.set_drive_mode = motor_actuator_stm32_set_drive_mode,
	.set_callback = motor_actuator_stm32_set_callback,
	.set_fault_callback = motor_actuator_stm32_set_fault_callback,
	.clear_fault = motor_actuator_stm32_clear_fault,
	.get_fault = motor_actuator_stm32_get_fault,
	.self_test = motor_actuator_self_test_noop,
	.get_config = motor_actuator_stm32_get_config,
	.sto_arm = motor_actuator_sto_arm_unsupported,
	.sto_release = motor_actuator_sto_release_unsupported,
};

#define TIM_FROM_PHANDLE(inst) ((TIM_TypeDef *)DT_REG_ADDR(DT_INST_PHANDLE(inst, st_pwm_timer)))
#define MOTOR_ACTUATOR_STM32_TIMER(inst) DT_INST_PHANDLE(inst, st_pwm_timer)
#define MOTOR_ACTUATOR_STM32_IRQ_FLAGS IRQ_ZERO_LATENCY

#define MOTOR_ACTUATOR_STM32_DEFINE(inst)                                                                 \
	PINCTRL_DT_INST_DEFINE(inst);                                                              \
	ISR_DIRECT_DECLARE(motor_actuator_stm32_pwm_isr_##inst)                                     \
	{                                                                                            \
		const struct device *dev = DEVICE_DT_GET(DT_DRV_INST(inst));                          \
		const struct motor_actuator_stm32_config *cfg = dev->config;                          \
		struct motor_actuator_stm32_data *data = dev->data;                                   \
		TIM_TypeDef *tim = cfg->tim;                                                         \
                                                                                                 \
		if ((LL_TIM_IsActiveFlag_UPDATE(tim) != 0UL) &&                                      \
		    (LL_TIM_IsEnabledIT_UPDATE(tim) != 0U)) {                                        \
			LL_TIM_ClearFlag_UPDATE(tim);                                               \
			if (data->actuator_cb != NULL) {                                             \
				data->actuator_cb(dev, data->actuator_user_data);                    \
			}                                                                            \
			motor_actuator_stm32_arm_slow_timer(dev);                                    \
		}                                                                                    \
		return 0;                                                                            \
	}                                                                                            \
	static const uint8_t pwm_ch_array_##inst[] = DT_INST_PROP(inst, pwm_channels);               \
	static const struct stm32_pclken motor_actuator_stm32_pclken_##inst[] =                     \
		STM32_DT_CLOCKS(MOTOR_ACTUATOR_STM32_TIMER(inst));                                 \
	static const struct motor_actuator_stm32_config motor_actuator_stm32_cfg_##inst = {          \
		.tim = TIM_FROM_PHANDLE(inst),                                                     \
		.pclken = motor_actuator_stm32_pclken_##inst,                                      \
		.pclk_len = ARRAY_SIZE(motor_actuator_stm32_pclken_##inst),                        \
		.pwm_ch = pwm_ch_array_##inst,                                                     \
		.n_half_bridges = (uint8_t)ARRAY_SIZE(pwm_ch_array_##inst),                        \
		.single_ended = DT_INST_PROP_OR(inst, single_ended, 0),                            \
		.pwm_freq_hz = (uint32_t)DT_INST_PROP(inst, pwm_frequency),                       \
		.trgo = MOTOR_ACTUATOR_STM32_TRGO_FROM_ENUM(inst),                                          \
		.deadtime_ns = (uint32_t)DT_INST_PROP(inst, deadtime_ns),                         \
		.nfault = GPIO_DT_SPEC_INST_GET_OR(inst, nfault_gpios, {0}),                        \
		.nsleep = GPIO_DT_SPEC_INST_GET_OR(inst, nsleep_gpios, {0}),                        \
		.en = GPIO_DT_SPEC_INST_GET_OR(inst, en_gpios, {0}),                                \
		.has_nfault = DT_NODE_HAS_PROP(DT_DRV_INST(inst), nfault_gpios),                   \
		.has_nsleep = DT_NODE_HAS_PROP(DT_DRV_INST(inst), nsleep_gpios),                   \
		.has_en = DT_NODE_HAS_PROP(DT_DRV_INST(inst), en_gpios),                            \
		.slow_timer = DEVICE_DT_GET(DT_INST_PHANDLE(inst, slow_timer)),                    \
		.slow_sample_div = (uint32_t)DT_INST_PROP(inst, slow_sample_div),                  \
		.stage_cfg =                                                                        \
			{                                                                             \
				.topology = (ARRAY_SIZE(pwm_ch_array_##inst) <= 1U)                        \
						    ? MOTOR_STAGE_HALF_BRIDGE                              \
						    : MOTOR_STAGE_FULL_BRIDGE,                           \
				.n_phases = (uint8_t)ARRAY_SIZE(pwm_ch_array_##inst),                 \
				.pwm_period_ns =                                                      \
					(uint32_t)(NSEC_PER_SEC / (uint32_t)DT_INST_PROP(inst,          \
										     pwm_frequency)), \
				.deadtime_rising_ns = (uint32_t)DT_INST_PROP(inst, deadtime_ns),      \
				.deadtime_falling_ns = (uint32_t)DT_INST_PROP(inst, deadtime_ns),     \
				.v_bus_nominal = 12.0f,                                              \
				.v_bus_ov_thresh = 30.0f,                                            \
				.v_bus_uv_thresh = 6.0f,                                             \
				.i_peak_limit = 20.0f,                                               \
			},                                                                            \
	};                                                                                           \
	BUILD_ASSERT(ARRAY_SIZE(pwm_ch_array_##inst) >= 1U &&                                      \
			     ARRAY_SIZE(pwm_ch_array_##inst) <= HB_MAX,                              \
		     "pwm-channels: length must be 1..3");                                         \
	BUILD_ASSERT(DT_INST_PROP(inst, single_ended) ||                                           \
			     DT_IRQ_HAS_NAME(MOTOR_ACTUATOR_STM32_TIMER(inst), brk),                \
		     "complementary mode requires advanced timer with \"brk\" interrupt");           \
	BUILD_ASSERT(!DT_INST_PROP(inst, single_ended) ||                                          \
			     DT_IRQ_HAS_NAME(MOTOR_ACTUATOR_STM32_TIMER(inst), up) ||                \
			     DT_IRQ_HAS_NAME(MOTOR_ACTUATOR_STM32_TIMER(inst), global),            \
		     "single-ended timer needs \"up\" or \"global\" interrupt");                   \
	BUILD_ASSERT(DT_INST_PROP(inst, single_ended) ||                                          \
			     (DT_INST_PROP_LEN(inst, pinctrl_0) ==                                  \
			      (2U * ARRAY_SIZE(pwm_ch_array_##inst))),                             \
		     "pinctrl-0 (complementary) length must equal 2 * len(pwm-channels)");        \
	BUILD_ASSERT(!DT_INST_PROP(inst, single_ended) ||                                          \
			     (COND_CODE_1(DT_INST_NODE_HAS_PROP(inst, pinctrl_1),                  \
					  (DT_INST_PROP_LEN(inst, pinctrl_1)), (0U)) ==        \
			      ARRAY_SIZE(pwm_ch_array_##inst)),                                    \
		     "single-ended requires pinctrl-1 with len(pwm-channels) HS-only pins");      \
	static struct motor_actuator_stm32_data motor_actuator_stm32_data_##inst;                    \
	static int motor_actuator_stm32_dev_init_##inst(const struct device *dev)                       \
	{                                                                                            \
		const struct motor_actuator_stm32_config *cfg_ = dev->config;                       \
		uint8_t pinctrl_state_ = cfg_->single_ended                                         \
			? PINCTRL_STATE_SINGLE_ENDED                                                \
			: PINCTRL_STATE_COMPLEMENTARY;                                              \
		int err_ = pinctrl_apply_state(PINCTRL_DT_INST_DEV_CONFIG_GET(inst),                 \
					       pinctrl_state_);                                       \
		if (err_ != 0) {                                                                     \
			return err_;                                                                 \
		}                                                                                    \
		err_ = motor_actuator_stm32_hw_init(dev);                                            \
		if (err_ != 0) {                                                                     \
			return err_;                                                                 \
		}                                                                                    \
		COND_CODE_1(DT_IRQ_HAS_NAME(MOTOR_ACTUATOR_STM32_TIMER(inst), up),                           \
			    (IRQ_DIRECT_CONNECT(DT_IRQ_BY_NAME(MOTOR_ACTUATOR_STM32_TIMER(inst), up, irq),  \
						DT_IRQ_BY_NAME(MOTOR_ACTUATOR_STM32_TIMER(inst), up, priority), \
						motor_actuator_stm32_pwm_isr_##inst,                    \
						MOTOR_ACTUATOR_STM32_IRQ_FLAGS);                        \
			     irq_enable(DT_IRQ_BY_NAME(MOTOR_ACTUATOR_STM32_TIMER(inst), up, irq));),       \
			    (COND_CODE_1(                                                             \
				    DT_IRQ_HAS_NAME(MOTOR_ACTUATOR_STM32_TIMER(inst), global),              \
				    (IRQ_DIRECT_CONNECT(                                              \
					     DT_IRQ_BY_NAME(MOTOR_ACTUATOR_STM32_TIMER(inst), global, irq), \
					     DT_IRQ_BY_NAME(MOTOR_ACTUATOR_STM32_TIMER(inst), global,       \
							     priority),                            \
					     motor_actuator_stm32_pwm_isr_##inst,                           \
					     MOTOR_ACTUATOR_STM32_IRQ_FLAGS);                        \
				     irq_enable(DT_IRQ_BY_NAME(MOTOR_ACTUATOR_STM32_TIMER(inst), global,  \
							       irq));),                            \
				    (BUILD_ASSERT(0,                                                 \
						  "st,pwm-timer needs interrupt-names "            \
						  "\"up\" or \"global\"")))));                       \
		return 0;                                                                            \
	}                                                                                            \
	DEVICE_DT_DEFINE(DT_DRV_INST(inst), motor_actuator_stm32_dev_init_##inst, NULL,                 \
			 &motor_actuator_stm32_data_##inst, &motor_actuator_stm32_cfg_##inst,          \
			 POST_KERNEL, CONFIG_MOTOR_STAGE_HBRIDGE_STM32_INIT_PRIORITY,                \
			 &motor_actuator_stm32_api);

DT_INST_FOREACH_STATUS_OKAY(MOTOR_ACTUATOR_STM32_DEFINE)
